tylertms/dspic33e-sim/conformance/adc.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"
#include "sfr_side_effect_coverage.h"

static const SfrSideEffectCoverage adc_sfr_side_effect_coverage[] = {
    {0x0320u, 0x0001u},
    {0x0360u, 0x0001u},
};

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} AdcConformance;

static const uint16_t buffers[DSPIC33_ADC_COUNT] = {0x0300u, 0x0340u};
static const uint16_t controls[DSPIC33_ADC_COUNT] = {0x0320u, 0x0360u};
static const uint16_t dma_controls[DSPIC33_ADC_COUNT] = {0x0332u, 0x0372u};
static const uint8_t irqs[DSPIC33_ADC_COUNT] = {13u, 21u};

static void expect(AdcConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[adc-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~(uint16_t)(1u << (irq % 16u))));
}

static void set_input(Dspic33* cpu, uint8_t channel, uint16_t value) {
    dspic33_adc_input(cpu, channel, value);
}

static void start_manual(Dspic33* cpu, uint8_t module) {
    uint16_t control = dspic33_read_word(cpu, controls[module]);
    dspic33_write_word(cpu, controls[module], (uint16_t)(control | 0x0002u));
    dspic33_write_word(cpu, controls[module],
                       (uint16_t)(dspic33_read_word(cpu, controls[module]) & ~0x0002u));
}

static void finish_conversion(Dspic33* cpu, uint8_t module) {
    uint16_t timing = dspic33_read_word(cpu, (uint16_t)(controls[module] + 4u));
    uint64_t clock = (timing & 0x8000u) != 0u ? 1u : (timing & 0x00ffu) + 1u;
    uint64_t cycles =
        (module == 0u && (dspic33_read_word(cpu, controls[module]) & 0x0400u) != 0u)
            ? 14u * clock
            : 12u * clock;
    dspic33_device_advance(cpu, cycles);
}

static void configure_manual(Dspic33* cpu, uint8_t module, uint16_t control,
                             uint16_t control2, uint16_t channels) {
    dspic33_write_word(cpu, controls[module], 0u);
    dspic33_write_word(cpu, (uint16_t)(controls[module] + 2u), control2);
    dspic33_write_word(cpu, (uint16_t)(controls[module] + 8u), channels);
    dspic33_write_word(cpu, controls[module], (uint16_t)(control | 0x8000u));
}

static uint16_t expected_format(uint16_t code, uint8_t bits, uint8_t format) {
    uint8_t shift = (uint8_t)(16u - bits);
    uint16_t sign = (uint16_t)(1u << (bits - 1u));
    uint16_t mask = (uint16_t)((1u << bits) - 1u);
    if (format == 0u) {
        return code;
    }
    if (format == 2u) {
        return (uint16_t)(code << shift);
    }
    code ^= sign;
    if ((code & sign) != 0u) {
        code |= (uint16_t)~mask;
    }
    return format == 1u ? code : (uint16_t)(code << shift);
}

static void register_cases(AdcConformance* state, Dspic33* cpu) {
    uint8_t module;
    uint8_t index;
    dspic33_reset(cpu, 0u);
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        expect(state, dspic33_read_word(cpu, controls[module]) == 0u,
               "control one reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(controls[module] + 2u)) == 0u,
               "control two reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(controls[module] + 4u)) == 0u,
               "control three reset");
        dspic33_write_word(cpu, (uint16_t)(controls[module] + 2u), 0xffffu);
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(controls[module] + 2u)) ==
                   (module == 0u ? 0xe77fu : 0xe73fu),
               "control two mask");
        dspic33_write_word(cpu, (uint16_t)(controls[module] + 4u), 0xffffu);
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(controls[module] + 4u)) == 0x9fffu,
               "control three mask");
        dspic33_write_word(cpu, (uint16_t)(controls[module] + 6u), 0xffffu);
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(controls[module] + 6u)) == 0x0707u,
               "channel one through three mask");
        dspic33_write_word(cpu, (uint16_t)(controls[module] + 8u), 0xffffu);
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(controls[module] + 8u)) == 0x9f9fu,
               "channel zero mask");
        for (index = 0u; index < 16u; index++) {
            dspic33_write_word(cpu, (uint16_t)(buffers[module] + index * 2u), 0xa55au);
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(buffers[module] + index * 2u)) ==
                       0u,
                   "result buffer read only");
        }
    }
    dspic33_write_word(cpu, 0x032eu, 0xffffu);
    dspic33_write_word(cpu, 0x0330u, 0xffffu);
    dspic33_write_word(cpu, 0x0332u, 0xffffu);
    dspic33_write_word(cpu, 0x0370u, 0xffffu);
    dspic33_write_word(cpu, 0x0372u, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x032eu) == 0xffffu, "adc one high scan mask");
    expect(state, dspic33_read_word(cpu, 0x0330u) == 0xffffu, "adc one low scan mask");
    expect(state, dspic33_read_word(cpu, 0x0332u) == 0x0107u, "adc one dma mask");
    expect(state, dspic33_read_word(cpu, 0x0370u) == 0xffffu, "adc two scan mask");
    expect(state, dspic33_read_word(cpu, 0x0372u) == 0x0107u, "adc two dma mask");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0360u, 0x4c01u);
    expect(state, dspic33_read_word(cpu, 0x0360u) == 0u,
           "adc two unimplemented resolution and done");
    dspic33_write_word(cpu, 0x0320u, 0x0008u);
    expect(state, dspic33_read_word(cpu, 0x0320u) == 0x0008u,
           "ten bit simultaneous sampling available");
    dspic33_write_word(cpu, 0x0322u, 0x0300u);
    dspic33_write_word(cpu, 0x0326u, 0x0707u);
    dspic33_write_word(cpu, 0x0320u, 0x0408u);
    expect(state, dspic33_read_word(cpu, 0x0320u) == 0x0400u,
           "twelve bit simultaneous unavailable");
    expect(state, (dspic33_read_word(cpu, 0x0322u) & 0x0300u) == 0u,
           "twelve bit channel selection unavailable");
    expect(state, dspic33_read_word(cpu, 0x0326u) == 0u,
           "twelve bit extra channels unavailable");
    dspic33_write_word(cpu, 0x0320u, 0u);
    expect(state, dspic33_read_word(cpu, 0x0320u) == 0u,
           "return to ten bit mode does not restore simultaneous sampling");
    dspic33_write_word(cpu, 0x0360u, 0x0008u);
    expect(state, dspic33_read_word(cpu, 0x0360u) == 0x0008u,
           "adc two simultaneous sampling available");
    dspic33_write_word(cpu, 0x0360u, 0x0408u);
    expect(state, dspic33_read_word(cpu, 0x0360u) == 0x0008u,
           "adc two rejects resolution while retaining simultaneous sampling");
    dspic33_write_word(cpu, 0x0320u, 0x8400u);
    dspic33_write_word(cpu, 0x0320u, 0x8000u);
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0400u) != 0u,
           "resolution locked while enabled");
}

static void format_cases(AdcConformance* state, Dspic33* cpu) {
    static const uint16_t inputs[] = {0u, 4u, 0x07fcu, 0x0800u, 0x0ffcu};
    uint8_t module;
    uint8_t resolution;
    uint8_t format;
    uint8_t index;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        for (resolution = 0u; resolution < (module == 0u ? 2u : 1u); resolution++) {
            uint8_t bits = resolution != 0u ? 12u : 10u;
            for (format = 0u; format < 4u; format++) {
                for (index = 0u; index < sizeof(inputs) / sizeof(inputs[0]); index++) {
                    uint16_t code = resolution != 0u ? inputs[index]
                                                     : (uint16_t)(inputs[index] >> 2u);
                    dspic33_reset(cpu, 0u);
                    set_input(cpu, 0u, inputs[index]);
                    configure_manual(cpu, module,
                                     (uint16_t)((resolution != 0u ? 0x0400u : 0u) |
                                                ((uint16_t)format << 8u)),
                                     0u, 0u);
                    start_manual(cpu, module);
                    finish_conversion(cpu, module);
                    expect(state,
                           dspic33_read_word(cpu, buffers[module]) ==
                               expected_format(code, bits, format),
                           "conversion output format");
                    expect(state, (dspic33_read_word(cpu, controls[module]) & 1u) != 0u,
                           "conversion done flag");
                    dspic33_write_word(
                        cpu, controls[module],
                        (uint16_t)(dspic33_read_word(cpu, controls[module]) & ~1u));
                    expect(state, (dspic33_read_word(cpu, controls[module]) & 1u) == 0u,
                           "done flag software clear");
                }
            }
        }
    }
}

static void done_access_cases(AdcConformance* state, Dspic33* cpu) {
    uint8_t module;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, controls[module], 0x0001u);
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "done write one cannot set");
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, 0u, 0u, 0u);
        start_manual(cpu, module);
        finish_conversion(cpu, module);
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "done hardware set");
        dspic33_write_word(
            cpu, controls[module],
            (uint16_t)(dspic33_read_word(cpu, controls[module]) | 0x0001u));
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "done write one preserves set");
        dspic33_write_word(
            cpu, controls[module],
            (uint16_t)(dspic33_read_word(cpu, controls[module]) & ~0x0001u));
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "done software clear");
    }
}

static void done_active_conversion_cases(AdcConformance* state, Dspic33* cpu) {
    uint8_t module;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, 0u, 0u, 0u);
        start_manual(cpu, module);
        finish_conversion(cpu, module);
        expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
               "done active initial result");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "done active initial completion");
        set_input(cpu, 0u, 800u);
        start_manual(cpu, module);
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "conversion start clears done");
        dspic33_write_word(
            cpu, controls[module],
            (uint16_t)(dspic33_read_word(cpu, controls[module]) & ~0x0001u));
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "active conversion done clear");
        expect(state, dspic33_device_advance(cpu, 11u),
               "active conversion precompletion advance");
        expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
               "active conversion preserves prior result");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "active conversion remains incomplete");
        expect(state, dspic33_device_advance(cpu, 1u),
               "active conversion completion advance");
        expect(state, dspic33_read_word(cpu, buffers[module]) == 200u,
               "active conversion completes after clear");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "active conversion restores done");
    }
}

